FKDD_COPY_DIFF_3_2026-02-13/DataProcessors/АРМЗаписьНаРемонт.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<DataProcessor>
		<Properties>
			<Name>АРМЗаписьНаРемонт</Name>
			<Comment>АРМ Запись на ремонт</Comment>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>БазовыйГрафик</Name>
					<Comment>Базовый график</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.ГрафикиРаботы</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаОтчета</Name>
					<Comment>Дата календаря в данный момент</Comment>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЗапретРедактированияУРВ</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИнтервалАвтоматическогоОбновления</Name>
					<Comment>Интервал автоматического обновления, сек</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>3</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИнтервалКалендаря</Name>
					<Comment>Интервал календаря</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>2</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИспользованиеГрафиковРабот</Name>
					<Comment>Использование графиков работ</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>1</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КритерийРасчетаЗагруженности</Name>
					<Comment>Критерий расчета загруженности</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>1</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОтображатьДанныеУРВ</Name>
					<Comment>Отображать данные УРВ</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>1</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОтображатьЛегенду</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>1</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОтображатьТолькоРаботающих</Name>
					<Comment>Отображать только работающих согласно графику</Comment>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПоворотКалендаря</Name>
					<Comment>Ориентация календаря (по вертикали/по горизонтали)</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>1</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Продолжительность</Name>
					<Comment>Продолжительность</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>2</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РежимДобавленияРаботы</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>1</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РежимКалендаря</Name>
					<Comment>Режим календаря (по цехам/по исполнителям)</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>1</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РежимКалендаряПоУмолчанию</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>1</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РежимПланирования</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>1</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РежимПоказателейПоУмолчанию</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>1</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ФорматПредставленияЗаявкиНаРемонт</Name>
					<Comment>Формат представления заявки на ремонт</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ШиринаКолонкиВертикально</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>3</v8:Digits>
							<v8:FractionDigits>1</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ШиринаКолонкиГоризонтально</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>3</v8:Digits>
							<v8:FractionDigits>1</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТипыОбращений</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ТипыОбращений</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>АвтоработаПриемки</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Автоработы</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>АвтоработаВыдачи</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Автоработы</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВремяДляПриемки</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВремяДляВыдачи</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>ОтборыЦеха</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Подразделение</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ПодразделенияКомпании</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Цех</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Цеха</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ОтборыИсполнители</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Подразделение</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ПодразделенияКомпании</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Должность</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Должности</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Сотрудник</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Сотрудники</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</DataProcessor>
</MetaDataObject>

FKDD_COPY_DIFF_3_2026-02-13/DataProcessors/АРМЗаписьНаРемонт/Ext/ManagerModule.bsl
// Модуль менеджера обработки АРМЗаписьНаРемонт

// Получает общие настройки АРМ и значения для них по умолчанию
//
Функция ПолучитьСписокНастроекАРМ() Экспорт
	
	СтруктураНастроек = Новый Структура;
	СтруктураНастроек.Вставить("БазовыйГрафик", 					ПараметрыСеанса.Пользователь.Подразделение.ГрафикРаботы);
	СтруктураНастроек.Вставить("ДатаОтчета", 						ТекущаяДата());
	СтруктураНастроек.Вставить("ЗапретРедактированияУРВ",			Истина);
	СтруктураНастроек.Вставить("ИнтервалАвтоматическогоОбновления", 60);
	СтруктураНастроек.Вставить("ИнтервалКалендаря", 				30);
	СтруктураНастроек.Вставить("ИспользованиеГрафиковРабот", 		2);
	СтруктураНастроек.Вставить("КритерийРасчетаЗагруженности", 		1);
	СтруктураНастроек.Вставить("ОтображатьДанныеУРВ", 				0);
	СтруктураНастроек.Вставить("ОтображатьЛегенду", 				0);
	СтруктураНастроек.Вставить("ОтображатьТолькоРаботающих", 		Ложь);
	СтруктураНастроек.Вставить("ПоворотКалендаря", 					2);
	СтруктураНастроек.Вставить("Продолжительность", 				1);
	СтруктураНастроек.Вставить("РежимДобавленияРаботы", 			1);
	СтруктураНастроек.Вставить("РежимКалендаря", 					1);
	СтруктураНастроек.Вставить("РежимКалендаряПоУмолчанию", 		1);
	СтруктураНастроек.Вставить("РежимПланирования", 				1);
	СтруктураНастроек.Вставить("ФорматПредставленияЗаявкиНаРемонт", "&Н от &Д
																	|заказчик: &З, &Т 
																	|автомобиль: &А, &Г
																	|мастер: &М
																	|диспетчер: &И
																	|вид ремонта: &Р
																	|начало работ: &Ч
																	|окончание работ: &О
																	|причина обращения: &П");
	СтруктураНастроек.Вставить("ШиринаКолонкиВертикально", 			18);
	СтруктураНастроек.Вставить("ШиринаКолонкиГоризонтально", 		4);
	СтруктураНастроек.Вставить("ТаблицаПорядкаРабочихМест",			Новый Массив);
	СтруктураНастроек.Вставить("АвтоработаПриемки",					Справочники.Автоработы.ПустаяСсылка());
	СтруктураНастроек.Вставить("АвтоработаВыдачи",					Справочники.Автоработы.ПустаяСсылка());
	СтруктураНастроек.Вставить("ВремяДляПриемки",					15);
	СтруктураНастроек.Вставить("ВремяДляВыдачи",					15);
	
	Возврат СтруктураНастроек;
	
КонецФункции
